Revit API Introduction Labs
Lab4_4_1_CreatePerDocParameters Class
 Add and bind a visible and an invisible per-doc parameter.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public class Lab4_4_1_CreatePerDocParameters : IExternalCommand
Visual Basic (Declaration)
Public Class Lab4_4_1_CreatePerDocParameters _
	Implements IExternalCommand
Visual C++
public ref class Lab4_4_1_CreatePerDocParameters : IExternalCommand
Inheritance Hierarchy
System.Object
 Labs.Lab4_4_1_CreatePerDocParameters
See Also
Lab4_4_1_CreatePerDocParameters Members
Labs Namespace